EX17: PROC OPTIONS (MAIN);                                                      DCL A BIN FIXED (15) INIT (1);                                                   DCL B BIN FIXED (15) INIT (5);                                                   DCL C BIN FIXED (15);                                                            IF A < B THEN                                                                    C = B - A;                                                                       ELSE                                                                             DO;                                                                              C = A - B;                                                                       C = C + 2;                                                                       END;                                                                             END EX17;                                                                       
